# Argus-V8X (YOLOv8 + SimAM + Swin@P5)
# Requires: SimAM, SwinBlock registered in ultralytics.nn.modules
nc: 4

scales:
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

# ---------------------------
# Backbone
# ---------------------------
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]           # 0  P1/2
  - [-1, 1, Conv, [128, 3, 2]]          # 1  P2/4
  - [-1, 3, C2f, [128, True]]           # 2
  - [-1, 1, SimAM, []]                  # 3

  - [-1, 1, Conv, [256, 3, 2]]          # 4  P3/8
  - [-1, 6, C2f, [256, True]]           # 5
  - [-1, 1, SimAM, []]                  # 6

  - [-1, 1, Conv, [512, 3, 2]]          # 7  P4/16
  - [-1, 6, C2f, [512, True]]           # 8
  - [-1, 1, SimAM, []]                  # 9

  - [-1, 1, Conv, [1024, 3, 2]]         # 10 P5/32
  - [-1, 3, C2f, [1024, True]]          # 11
  - [-1, 1, SimAM, []]                  # 12
  - [-1, 1, SwinBlock, [1024, 1, 7, 4, 4]]  # 13 Swin @ P5
  - [-1, 1, SPPF, [1024, 5]]            # 14

# ---------------------------
# Head (PAN/FPN)
# ---------------------------
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]      # 15 up: P5->P4
  - [[-1, 9], 1, Concat, [1]]                       # 16 cat with P4
  - [-1, 3, C2f, [512]]                              # 17
  - [-1, 1, SimAM, []]                               # 18

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]      # 19 up: P4->P3
  - [[-1, 6], 1, Concat, [1]]                       # 20 cat with P3
  - [-1, 3, C2f, [256]]                              # 21  (P3/8)
  - [-1, 1, SimAM, []]                               # 22

  - [-1, 1, Conv, [256, 3, 2]]                       # 23 down to P4
  - [[-1, 18], 1, Concat, [1]]                        # 24 cat with P4 head
  - [-1, 3, C2f, [512]]                               # 25  (P4/16)
  - [-1, 1, SimAM, []]                                # 26

  - [-1, 1, Conv, [512, 3, 2]]                        # 27 down to P5
  - [[-1, 14], 1, Concat, [1]]                         # 28 cat with P5
  - [-1, 3, C2f, [1024]]                               # 29  (P5/32)
  - [-1, 1, SimAM, []]                                 # 30

  - [[22, 26, 30], 1, Detect, [nc]]                   # 31 Detect(P3,P4,P5)